Repository: sonia-othman/zheer-app
Catalog: lib/l10n/app_*.arb
Languages: ku

# appTitle
source: Smart Sensor Dashboard
ku: داشبۆردی سێنسەری زیرەک

source: Home
ku: سەرەکی

source: Notifications
ku: ئاگادارکردنەوەکان

source: Device Dashboard
ku: داشبۆردی ئامێر

source: Settings
ku: ڕێکخستنەکان

source: Device ID
ku: ناسنامەی ئامێر

source: Status
ku: دۆخ

source: Temperature
ku: پلەی گەرمی

source: Battery
ku: پاتری

source: Count
ku: ژمارە

source: No Data
ku: هیچ داتایەک بەردەست نییە

# tempAndBattery
source: Temperature & Battery Levels
ku: پلەی گەرمی و پاتری

source: No Notifications
ku: هیچ ئاگادارکردنەوەیەک بەردەست نییە

source: Opened
ku: کراوەتەوە

source: Closed
ku: داخراوە

source: Daily
ku: ڕۆژانە

source: Weekly
ku: هەفتانە

source: Monthly
ku: مانگانە

source: Error Loading Data
ku: هەڵە لە بارکردنی داتا

source: Try Again
ku: دووبارە هەوڵ بدەوە

source: Refresh
ku: نوێکردنەوە

source: Load More
ku: زیاتر ببینە

source: API Error
ku: هەڵەی API

source: Retry API Call
ku: دووبارە API بانگ بکە

# noDataAvailable
source: No data available for selected time range
ku: هیچ داتایەک بەردەست نییە بۆ ئەو کاتەی دیاریکراوە

source: No notifications available
ku: هیچ ئاگادارکردنەوەیەک بەردەست نییە

source: No more notifications
ku: هیچ ئاگادارکردنەوەی تری نییە

source: Event Count
ku: ژمارەی ڕووداو

source: Temperature & Battery Levels
ku: ئاستی پلەی گەرمی و پاتری

source: Temperature (°C)
ku: پلەی گەرمی (°س)

# batteryPercent
source: Battery (%)
ku: پاتری (%)

source: All types
ku: هەموو جۆرەکان

source: Success
ku: سەرکەوتوو

source: Info
ku: زانیاری

source: Danger
ku: مەترسی

source: Warning
ku: ئاگاداری

source: Door opened 🚪
ku: دەرگاکە کرایەوە 🚪

source: Door closed ✅
ku: دەرگاکە داخرا ✅

# temp_too_high
source: Temperature is too high: {temperature}°C 🔥
ku: بەرزترین پلەی گەرمی {temperature}°C 🔥

# temp_too_low
source: Temperature is too low: {temperature}°C ❄️
ku: نزمترین پلەی گەرمی {temperature}°C ❄️

# connection_lost
source: Lost connection to sensor ❌
ku: پەیوەندیو بە سێنسەرەکەوە نەما ❌

# battery_critical
source: Battery level critical: {battery}V 🔋
ku: نزمترین ئاستی پاتری: {battery}V 🔋

# battery_low
source: Battery level low: {battery}V ⚠️
ku: ئاستی پاتریەکە نزمە: {battery}V ⚠️

# door_open_too_long
source: Door has been open for more than {minutes} minute(s) ⚠️
ku: دەرگا بۆ ماوەی زیاتر لە {minutes} خولەکە کراوەیە ⚠️

source: Just now
ku: ئێستا

# minutesAgo
source: {minutes}m ago
ku: {minutes} خولەک پێش ئێستا

# hoursAgo
source: {hours}h ago
ku: {hours} کاتژمێر پێش ئێستا

source: Unknown date
ku: بەرواری نەزانراو

source: Invalid date
ku: بەرواری هەڵە

source: Device
ku: ئامێر

source: Unregistered
ku: تۆمار نەکراوە

source: Retry
ku: دووبارە هەوڵ بدەوە

# deviceStats
source: Device Statistics
ku: ئاماری ئامێر

source: First Device
ku: ئامێری یەکەم

source: Second Device
ku: ئامێری دووەم

source: Third Device
ku: ئامێری سێیەم

# labDoor
source: IoT Lab Door
ku: دەرگای تاقیگەی IoT

# labWindow
source: IoT Lab Window
ku: پەنجەرەی تاقیگەی IoT

# department
source: Department Locker
ku: دۆڵابی بەش

source: Not Available
ku: بەردەست نییە

source: Sensor Not Registered
ku: هەستەوەر تۆمار نەکراوە

# temperatureShort
source: Temp
ku: پلە
